cf/src/Catalogs/СерверыПечати/СерверыПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверыПечати</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

cf/src/CommonModules/СервисПечатиПовтИсп/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Создает соединение по ссылке на сервер печати
// 
// Параметры:
//  СерверПечати - СправочникСсылка.СерверыПечати - Ссылка на элемент справочника сервер печати
// 
// Возвращаемое значение:
//  HTTPСоединение -HTTP соединение для выполнения запросов к серверу печати
Функция ПолучитьHTTPСоединениеДляСервераПечати(СерверПечати) Экспорт
	
	ОписаниеСервераПечати = Справочники.СерверыПечати.ПолучитьОписаниеПодключенияСервераПечати(СерверПечати);
				
	Соединение = Новый HTTPСоединение(ОписаниеСервераПечати.Сервер, 
									  ОписаниеСервераПечати.Порт,
									  ОписаниеСервераПечати.Пользователь,
									  ОписаниеСервераПечати.Пароль,
									  Неопределено,
									  ОписаниеСервераПечати.Таймаут);
									  
	
	Возврат Соединение;

КонецФункции

Функция ЗаписыватьИсторию() Экспорт
	
	Возврат Константы.СервисПечатиЗаписыватьИсторию.Получить();

КонецФункции

// Получить параметры бумаги по умолчанию.
// 
// Возвращаемое значение:
//  Структура - Получить параметры бумаги по умолчанию:
// * Ориентация - ПеречислениеСсылка.ОриентацияСтраницы - Ориентация страниц
// * Формат - СправочникСсылка.ФорматыБумаги - Используемый формат бумаги
Функция ПолучитьПараметрыБумагиПоУмолчанию() Экспорт

	Структура = Новый Структура();
	Структура.Вставить("Ориентация", Перечисления.ОриентацияСтраницы.Портретная);
	Структура.Вставить("Формат", Справочники.ФорматыБумаги.ПустаяСсылка());
	
	Структура.Ориентация = Константы.СервисПечатиОриентацияБумагиПоУмолчанию.Получить();
	Структура.Формат = Константы.СервисПечатиФорматБумагиПоУмолчанию.Получить();
	Возврат Структура;
	
КонецФункции

#КонецОбласти
